```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github-repository.github_issue_label.main["enhancement"] will be created
  + resource "github_issue_label" "main" {
      + color       = "c5def5"
      + description = "Indicates new feature requests"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "enhancement"
      + repository  = "playground.ashdavies.dev"
      + url         = (known after apply)
    }

  # module.github-repository.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      ~ homepage_url                = "https://playground.ashdavies.dev" -> "https://playground.ashdavies.dev/"
        id                          = "playground.ashdavies.dev"
        name                        = "playground.ashdavies.dev"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```